{"data":{"site":{"siteMetadata":{"title":"Blog of Yadullah Duman","author":"Yadullah Duman"}},"markdownRemark":{"id":"efa4eaa8-ebbc-5e52-89ee-34be34ffd44d","excerpt":"This is the first time where I actually recap my year and write about it. So let’s see what 2018 was like for me… React, React & React 201…","html":"<p>This is the first time where I actually recap my year and write about it. So let’s see what 2018 was like for me…</p>\n<h2>React, React &#x26; React</h2>\n<p>2018 was basically the year where I just fell in love with React. I tried to learn as many things I could and tried to encourage my colleagues at work to use it.\nIt’s just incredible how easy you can bootstrap a project and incrementally add new stuff on top of it. The API is straight forward and more advanced features are easily learned. And I think it’s what the core team also cares about. Simplicity and comprehensibility. I remember Brian Holt telling on <a href=\"https://frontendmasters.com/courses/complete-react-v4/course-introduction/\">Frontend Masters</a> that when he made a rewrite of a part at Reddit in React, he went to vacation after the rewrite. In vacation, he was unreachable and the software broke, but one of the backend developers was able to understand the code by reading it and fix the software without really knowing React or JavaScript. That was the moment where he really saw the value of React and I totally agree with him. I had quiet the same experience when I wanted to learn React, coming from the Java world and in the learning process I started to learn more and more JavaScript too. To be honest, I never had more fun while coding.</p>\n<p>At work</p>\n<h2>Diving deeper into JavaScript</h2>\n<h2>Trying to find a suiting Bachelor Thesis</h2>\n<h2>Thinking about the Future</h2>","timeToRead":1,"frontmatter":{"title":"My Recap of 2018","date":"December 23, 2018","spoiler":"Sharing some interesting moments of the year 2018"},"fields":{"slug":"/recap-2018/"}}},"pageContext":{"slug":"/recap-2018/","previous":{"fields":{"slug":"/react-hooks/"},"frontmatter":{"title":"Get Hooked with React Hooks"}},"next":null}}