{"data":{"site":{"siteMetadata":{"title":"Blog of Yadullah Duman","author":"Yadullah Duman"}},"markdownRemark":{"id":"efa4eaa8-ebbc-5e52-89ee-34be34ffd44d","excerpt":"This is the first time where I actually recap my year and write about it. So let’s see what 2018 was like for me… React, React & React 201…","html":"<p>This is the first time where I actually recap my year and write about it. So let’s see what 2018 was like for me…</p>\n<h2>React, React &#x26; React</h2>\n<p>2018 was basically the year where I just fell in love with React. I tried to learn as many things I could and tried to encourage my colleagues at work to use it.\nIt’s just incredible how easy you can bootstrap a project and incrementally add new stuff on top of it. The API is straight forward and more advanced features are easily learned. And I think it’s what the core team also cares about. Simplicity and comprehensibility. I remember Brian Holt telling on <a href=\"https://frontendmasters.com/courses/complete-react-v4/course-introduction/\">Frontend Masters</a> that when he made a rewrite of a part at Reddit in React, he went to vacation after the rewrite. In vacation, he was unreachable and the software broke, but one of the backend developers was able to understand the code by reading it and fix the software without really knowing React or JavaScript. That was the moment where he really saw the value of React and I totally agree with him. I had quiet the same experience when I wanted to learn React, coming from the Java world and in the learning process I started to learn more and more JavaScript too. To be honest, I never had more fun while coding.</p>\n<p>At work, I had several projects where I was able to use React. One of my biggest will be released soon. It’s <a href=\"https://github.com/yduman/retro\">Retro</a>. In our retrospectives we were relying on external tools and actually it would be better if we would’ve had some internal tool, because of privacy and other reasons. I thought it would be a great opportunity to work on a “bigger” project instead of always doing some small side projects. So I said that I’ll make it happen and now we are close to an MVP release.</p>\n<p>Another big project was for one of our customers. They wanted a smartphone app to query for some data. I propesed them to make a <a href=\"https://developers.google.com/web/progressive-web-apps/\">Progressive Web App</a> (PWA), since Create React App offered this feature already. By the way, you should know that the customer was relying heavily on oldschool tooling, so React was like a really fancy thing for them. I worked on that project alone and I could provide them a working prototype after a week. They couldn’t believe the development speed and consequently they held a meeting to overthink their blueprint strategies.</p>\n<p>So all in all React was a proving technology for me and I believe it still will be in 2019.</p>\n<h2>Diving deeper into JavaScript</h2>\n<p>After making my hands dirty with React, I wanted to learn more about JavaScript. I made a subscription on Frontend Masters and took some courses. Why Frontend Masters you ask? Because of the teachers. They are, in my opinion, well known and key figures in the world of frontend development. To dive deep into JavaScript, I would totally recommend the courses of <a href=\"https://frontendmasters.com/teachers/will-sentance/\">Will Sentance</a> and <a href=\"https://frontendmasters.com/teachers/kyle-simpson/\">Kyle Simpson</a>. They explain concepts like Scoping, Hoisting, Execution Context, Functional Programming, Closures, Asynchronous JavaScript, Object-Oriented JavaScript, etc. very very good and their style of teaching is remarkable. This gave me the foundation to think more about the internals of JavaScript and to think more about complex stuff than usual.</p>\n<h2>Scala and Static Code Analysis</h2>\n<p>Ultimately, I found a suiting Bachelor thesis for me. The first one I found and worked a bit on was not so good. Lots of C++ and ugly code, yuck. The second one, that I’m now working on, is really challenging but fun at the same time. It’s about generic bug detection using static code analysis. Like SpotBugs (formerly FindBugs), but more generic. The analyses are written in Scala and Scala itself is such an elegant language. I thought I’d have problems learning Scala, since I know it is maybe one of the hardest languages to learn, but I had good fundamentals by knowing Java, JavaScript and the conceptes of functional programming already. Furthermore the framework I am using (<a href=\"http://www.opal-project.de/\">OPAL</a>) provides a really nice API to quickly implement analyses.</p>\n<p>So in the process, I had to search for bugs first. Bugs that still existed in code, even after tests. After hours of searching in GitHub Issues, I found quite a bit of interesting bugs. The next step was to think about how these bugs occured in a generic way, something like abstract interpretation. Finally, I discussed the bugs with my professor. I loved the discussions, because they were always somehow philosophical. If all information was ready, I started to implement an analysis and tested it against the JDK and if you’re lucky you find interesting edge cases to think about!</p>\n<p>One analysis is already finished and next year I should start to write some pages for my thesis. I think I’ve chosen a great topic.</p>\n<h2>Socials</h2>\n<p>I am grateful to have the opportunity to work with great colleagues at MaibornWolff! Everyone cares about good and clean code. Discussions and solving problems are always interesting and you can party hard with them! I hope to spend more years together with them.</p>\n<p>Besides work, I tried to focus my social media, especially Twitter, to more topics like frontend development and open source development. To sum it up, best decision ever! I find daily interesting stuff to read and learn about! You get to know more people and their contribution to the community. Really worth it!</p>\n<h2>Thinking about the Future</h2>\n<p>I believe most of us are thinking about their future more at the end of a year. We are making New Year’s resolutions that we just never do or we do the same stuff everyday. Since I am close to graduating I am thinking more about my future. Being a software engineer, who loves to code, who loves problem solving, who wants to be an expert in his field, but who will never love math. I want to meet interesting and friendly people, gain more knowledge about interesting topics, try to teach people coding and try to make the world a better place. Find a passion, find something you love to do</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/UF8uR6Z6KLc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>","timeToRead":4,"frontmatter":{"title":"My Recap of 2018","date":"December 23, 2018","spoiler":"Sharing some interesting moments of the year 2018"},"fields":{"slug":"/recap-2018/"}}},"pageContext":{"slug":"/recap-2018/","previous":{"fields":{"slug":"/react-hooks/"},"frontmatter":{"title":"Get Hooked with React Hooks"}},"next":null}}